Repository: foolery33/BeAuTiCh
Catalog: Food-delivery-app/Resources/Localization/Errors/*.lproj/Errors.strings
Languages: ru

# server_error
source: Some server error occured. Please try again later
ru: Произошла ошибка сервера. Пожалуйста, повторите попытку позже

# model_error
source: Internal application error. Please contact developer
ru: Внутренняя ошибка приложения. Пожалуйста, свяжитесь с разработчиком

# unauthorized
source: Your authentication token is expired. Please login again
ru: Срок действия вашего авторизационного токена истек. Пожалуйста, войдите в систему снова

# forbidden_access
source: You've got no rights to perform this operation
ru: У вас нет прав, чтобы совершить эту операцию

# invalid_credentials
source: Either your e-mail or password are incorrect
ru: Ввёденный e-mail и/или пароль неверны

# conflicting_credentials
source: User with such e-mail already exists
ru: Пользователь с таким e-mail уже существует

# unexpected_error
source: Some unexpected error occured. Please contact developer
ru: Произошла непредвиденная ошибка. Пожалуйста, свяжитесь с разработчиком

source: Register error
ru: Ошибка регистрации

source: Login error
ru: Ошибка авторизации

# invalid_email
source: Your email does not conform to default email pattern
ru: Ваш E-mail не соответствует стандартному шаблону электронной почты

# empty_email
source: Please enter e-mail to continue
ru: Пожалуйста, введите e-mail, чтобы продолжить

# empty_password
source: Please enter password to continue
ru: Пожалуйста, введите пароль, чтобы продолжить

# empty_confirm_password
source: Please confirm password to continue
ru: Пожалуйста, подтвердите пароль, чтобы продолжить

# empty_first_name
source: Please enter first name to continue
ru: Пожалуйста, введите имя, чтобы продолжить

# empty_last_name
source: Please enter last name to continue
ru: Пожалуйста, введите фамилию, чтобы продолжить

# invalid_password
source: Password should contain at least one uppercase, one lowercase letter and one digit. The password should be at least 6 characters long
ru: Пароль должен содержать как минимум одну заглавную, одну строчную буквы и одну цифру. Длина пароля должна быть не менее 6 символов

# different_passwords
source: You've provided different passwords. Please make sure they are equal
ru: Вы ввели разные пароли. Пожалуйста, убедитесь, что они совпадают

# invalid_phone_number
source: Invalid phone number format
ru: Недействительный формат номера телефона

source: Ok
ru: Ок

source: Appointments loading error
ru: Ошибка загрузки записей

# services_loading_error
source: Error loading services
ru: Ошибка загрузки услуг

# password_changed_error
source: Password change error
ru: Ошибка смены пароля

# photo_not_found
source: Profile picture not found
ru: Фотография профиля не найдена

# not_correct_old_password
source: The old password entered is incorrect
ru: Введенный староль пароль является неверным

# not_fount_subscribe
source: Unfortunately, an error occurred on the server. Your subscription was not found, please try again
ru: К сожалению, произошла ошибка на сервере. Ваша подписка не нашлась, повторите попытку
