Repository: foolery33/BeAuTiCh
Catalog: Food-delivery-app/Resources/Localization/SettingsScreen/*.lproj/YourServicesViewScreen.strings
Languages: ru

# title_screen
source: Your services
ru: Ваши услуги

# there_is_not_services
source: You don't have any services yet
ru: У вас пока нет ни одной услуги

# there_is_not_subscribe
source: You can create your own services! Subscription is required
ru: Вы не можете создавать свои услуги! Необходима подписка

# choose_action
source: Select an action
ru: Выберите действие

# information_actions
source: You can edit or delete a service with the name
ru: Вы можете отредактировать или удалить услугу

source: Edit
ru: Изменить

source: Delete
ru: Удалить

source: Cancel
ru: Отмена

# edit_service
source: Editing service
ru: Редактирование услуги

source: Create service
ru: Добавить услугу

source: Save
ru: Сохранить

# input_name_service
source: Enter the name of the service*
ru: Введите название услуги*

# input_price_service
source: Enter the price of the service*
ru: Введите цену услуги*

# choose_duration_service
source: Choose the duration of the service*
ru: Выберите продолжительность услуги*
